[
  [
    "What's the average price of diamonds?",
    "The average diamond price in our dataset is $3933."
  ],
  [
    "What makes diamonds expensive?",
    "Diamond prices depend on the 4Cs: Carat weight, Cut quality, Color grade, and Clarity. Larger, well-cut diamonds with better color and clarity cost more."
  ],
  [
    "What's the most expensive diamond cut?",
    "In our data, Ideal cut diamonds tend to be most expensive."
  ],
  [
    "What are the 4Cs of diamonds?",
    "The 4Cs are Carat (weight), Cut (quality of proportions), Color (grade from D-Z), and Clarity (internal flaws)."
  ],
  [
    "What is diamond clarity?",
    "Diamond clarity refers to the absence of inclusions and blemishes. Grades range from FL (Flawless) to I3 (Included)."
  ],
  [
    "What does diamond color mean?",
    "Diamond color is graded D-Z, where D is colorless (most valuable) and Z has noticeable color."
  ],
  [
    "What ring do you recommend?",
    "We offer various ring styles starting from $509. Our rose gold rings are very popular."
  ],
  [
    "How much does a ring cost?",
    "Our ring prices range from $509 to $49945, with an average of $24955."
  ],
  [
    "What metals are available for ring?",
    "We offer rings in rose gold, silver, platinum, and other precious metals."
  ],
  [
    "What necklace do you recommend?",
    "We offer various necklace styles starting from $228. Our gold necklaces are very popular."
  ],
  [
    "How much does a necklace cost?",
    "Our necklace prices range from $228 to $29996, with an average of $15518."
  ],
  [
    "What metals are available for necklace?",
    "We offer necklaces in silver, gold, platinum, and other precious metals."
  ],
  [
    "What earrings do you recommend?",
    "We offer various earrings styles starting from $153. Our silver earringss are very popular."
  ],
  [
    "How much does a earrings cost?",
    "Our earrings prices range from $153 to $14969, with an average of $7515."
  ],
  [
    "What metals are available for earrings?",
    "We offer earringss in white gold, silver, gold, and other precious metals."
  ],
  [
    "What bracelet do you recommend?",
    "We offer various bracelet styles starting from $365. Our white gold bracelets are very popular."
  ],
  [
    "How much does a bracelet cost?",
    "Our bracelet prices range from $365 to $19994, with an average of $10543."
  ],
  [
    "What metals are available for bracelet?",
    "We offer bracelets in white gold, gold, platinum, and other precious metals."
  ],
  [
    "How do I choose an engagement ring?",
    "Consider the 4Cs for diamonds, her style preferences, ring size, and your budget. We offer consultations to help you decide."
  ],
  [
    "What's the difference between 14k and 18k gold?",
    "14k gold is 58% pure gold, more durable and affordable. 18k gold is 75% pure, softer but more valuable."
  ],
  [
    "How should I care for my jewelry?",
    "Clean regularly with mild soap, store separately, avoid chemicals, and have professional cleanings annually."
  ],
  [
    "Do you offer custom jewelry?",
    "Yes, we specialize in bespoke jewelry. Our process includes consultation, design, crafting, and delivery over 4-8 weeks."
  ],
  [
    "What is your return policy?",
    "We offer 30-day returns for unaltered items with original packaging. Custom pieces require 50% deposit."
  ]
]